Обработки/Reports/_ОтчетОДвиженииДенежныхСредствРСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДвиженииДенежныхСредствРСБУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДвиженииДенежныхСредствРСБУ/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о движении денежных средств (РСБУ)",
		"0.05",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
		
	Если НастройкиОтчета.Свойство("ЕдиницаИзмерения")
		И ЗначениеЗаполнено(НастройкиОтчета.ЕдиницаИзмерения) Тогда 
		ЕдиницаИзмерения = НастройкиОтчета.ЕдиницаИзмерения;
	Иначе
		ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1");
	КонецЕсли;
	
	Если НастройкиОтчета.Свойство("ТочностьЕдиницыИзмерения") Тогда
		ТочностьЕдиницыИзмерения = НастройкиОтчета.ТочностьЕдиницыИзмерения;
	Иначе
		ТочностьЕдиницыИзмерения = 2;
	КонецЕсли;
	
	Настройка = Новый Структура;
	Настройка.Вставить("ЕдиницаИзмерения",			ЕдиницаИзмерения);
	Настройка.Вставить("ТочностьЕдиницыИзмерения",	ТочностьЕдиницыИзмерения);
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект",			ЭтотОбъект.Организация);
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантРуководитель);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантГлавбух);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	ЮрЛицо = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);		
	СтруктураКлюча.Вставить("Объект",			ЮрЛицо);
			
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументАкт = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, , Настройка);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПодписантГлавбух");
	Настройки.Добавить("ПодписантРуководитель");
	Настройки.Добавить("ЕдиницаИзмерения");
	Настройки.Добавить("ТочностьЕдиницыИзмерения");	
	Настройки.Добавить("ВидУчета");	
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("ПодписантОтКлиента");
	Возврат Настройки;

КонецФункции

Функция ПолучитьДанные(Запрос)
	
#Область Запрос	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""01"" КАК Колонка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто2
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто3
		|	КОНЕЦ КАК ВидДвиженияДС,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.КорСубконто1) = ТИП(Справочник.Акции)
		|			ТОГДА ИСТИНА
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.КорСубконто2) = ТИП(Справочник.Акции)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоАкции,
		|	БухгалтерскийУчетОбороты.СуммаОборот КАК СуммаОборот
		|ПОМЕСТИТЬ _Обороты
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			Счет В ИЕРАРХИИ (&СчетаДС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто2
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто3
		|				КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств),
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто2
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто3
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.КорСубконто1) = ТИП(Справочник.Акции)
		|			ТОГДА ИСТИНА
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.КорСубконто2) = ТИП(Справочник.Акции)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	БухгалтерскийУчетОбороты.СуммаОборот
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&НачалоПрошлогоПериода,
		|			&ОкончаниеПрошлогоПериода,
		|			Период,
		|			Счет В ИЕРАРХИИ (&СчетаДС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто2
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто3
		|				КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств),
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто2
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто3
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	БухгалтерскийУчетОбороты.СуммаОборотДт * &УчитыватьПереводы
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			Счет В ИЕРАРХИИ (&СчетаДС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто2
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто3
		|				КОНЕЦ = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств),
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто2
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто3
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	БухгалтерскийУчетОбороты.СуммаОборотДт * &УчитыватьПереводы
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&НачалоПрошлогоПериода,
		|			&ОкончаниеПрошлогоПериода,
		|			Период,
		|			Счет В ИЕРАРХИИ (&СчетаДС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто2
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто3
		|				КОНЕЦ = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств),
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто2
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто3
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	-БухгалтерскийУчетОбороты.СуммаОборотКт * &УчитыватьПереводы
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			Счет В ИЕРАРХИИ (&СчетаДС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто2
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто3
		|				КОНЕЦ = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств),
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто2
		|		КОГДА ТИПЗНАЧЕНИЯ(БухгалтерскийУчетОбороты.Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|			ТОГДА БухгалтерскийУчетОбороты.Субконто3
		|	КОНЕЦ,
		|	ЛОЖЬ,
		|	-БухгалтерскийУчетОбороты.СуммаОборотКт * &УчитыватьПереводы
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
		|			&НачалоПрошлогоПериода,
		|			&ОкончаниеПрошлогоПериода,
		|			Период,
		|			Счет В ИЕРАРХИИ (&СчетаДС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто2
		|					КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.ВидыДвиженияДенежныхСредств)
		|						ТОГДА Субконто3
		|				КОНЕЦ = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ПереводДенежныхСредств),
		|			,
		|			) КАК БухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""01"" КАК Колонка,
		|	""39"" КАК Строка,
		|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _Остатки
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&НачалоПериода,
		|			Счет В (&СчетаДС),
		|			,
		|			Организация = Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	""40"",
		|	БухгалтерскийУчетОстатки.СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&ОкончаниеПериода,
		|			Счет В (&СчетаДС),
		|			,
		|			Организация = Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	""39"",
		|	БухгалтерскийУчетОстатки.СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&НачалоПрошлогоПериода,
		|			Счет В (&СчетаДС),
		|			,
		|			Организация = Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	""40"",
		|	БухгалтерскийУчетОстатки.СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&ОкончаниеПрошлогоПериода,
		|			Счет В (&СчетаДС),
		|			,
		|			Организация = Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Обороты.Колонка КАК Колонка,
		|	ВЫБОР
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПроценты)
		|			ТОГДА ""17""
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПродажа)
		|				И _Обороты.ЭтоАкции
		|			ТОГДА ""15""
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПродажа)
		|				И НЕ _Обороты.ЭтоАкции
		|			ТОГДА ""16""
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПокупка)
		|				И _Обороты.ЭтоАкции
		|			ТОГДА ""21""
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПокупка)
		|				И НЕ _Обороты.ЭтоАкции
		|			ТОГДА ""22""
		|		КОГДА НЕ _Обороты.ВидДвиженияДС В (&ДвиженияДСПроценты, &ДвиженияДСПродажа, &ДвиженияДСПокупка)
		|			ТОГДА ВЫБОР
		|					КОГДА _Обороты.СуммаОборот > 0
		|						ТОГДА ""18""
		|					ИНАЧЕ ""24""
		|				КОНЕЦ
		|	КОНЕЦ КАК Строка,
		|	СУММА(_Обороты.СуммаОборот) КАК Сумма,
		|	_Обороты.ВидДвиженияДС КАК ВидДвиженияДС
		|ПОМЕСТИТЬ _Расшифровка
		|ИЗ
		|	_Обороты КАК _Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	_Обороты.Колонка,
		|	ВЫБОР
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПроценты)
		|			ТОГДА ""17""
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПродажа)
		|				И _Обороты.ЭтоАкции
		|			ТОГДА ""15""
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПродажа)
		|				И НЕ _Обороты.ЭтоАкции
		|			ТОГДА ""16""
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПокупка)
		|				И _Обороты.ЭтоАкции
		|			ТОГДА ""21""
		|		КОГДА _Обороты.ВидДвиженияДС В (&ДвиженияДСПокупка)
		|				И НЕ _Обороты.ЭтоАкции
		|			ТОГДА ""22""
		|		КОГДА НЕ _Обороты.ВидДвиженияДС В (&ДвиженияДСПроценты, &ДвиженияДСПродажа, &ДвиженияДСПокупка)
		|			ТОГДА ВЫБОР
		|					КОГДА _Обороты.СуммаОборот > 0
		|						ТОГДА ""18""
		|					ИНАЧЕ ""24""
		|				КОНЕЦ
		|	КОНЕЦ,
		|	_Обороты.ВидДвиженияДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Расшифровка.Колонка КАК Колонка,
		|	_Расшифровка.Строка КАК Строка,
		|	СУММА(_Расшифровка.Сумма) КАК Сумма
		|ИЗ
		|	_Расшифровка КАК _Расшифровка
		|
		|СГРУППИРОВАТЬ ПО
		|	_Расшифровка.Строка,
		|	_Расшифровка.Колонка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Остатки.Колонка,
		|	_Остатки.Строка,
		|	_Остатки.СуммаОстаток
		|ИЗ
		|	_Остатки КАК _Остатки";
	
#КонецОбласти	
	
	Если ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет" , "НалоговыйУчет");
	КонецЕсли;		
	
	ОкончаниеПрошлогоПериода = ДобавитьМесяц(ЭтотОбъект.Период.ДатаОкончания, -12);
	НачалоПрошлогоПериода = ДобавитьМесяц(ЭтотОбъект.Период.ДатаНачала, -12);
	
	ДатаРеформацииПериод = ПолучитьПоследнююДатуРеформации(СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
	//начальная датв уже должна быть с датой реформации 
	Если ДатаРеформацииПериод > НачалоГода(ЭтотОбъект.Период.ДатаНачала) Тогда 
		//была реформация в этом году. Не считаем прошлый год. 
		НачалоПрошлогоПериода = Дата(2000, 1, 1);
		ОкончаниеПрошлогоПериода = Дата(2000, 1, 1);
	Иначе 
		ДатаРеформацииКонецГода = ПолучитьПоследнююДатуРеформации(ЭтотОбъект.СчетДоверительногоУправления, НачалоГода(ЭтотОбъект.Период.ДатаНачала));
		Если ОкончаниеПрошлогоПериода >= ДатаРеформацииКонецГода Тогда 
			НачалоПрошлогоПериода = Макс(НачалоПрошлогоПериода, ДатаРеформацииКонецГода);
		Иначе 
			//период меньше даты реформации прошлого года. не считаем 
			НачалоПрошлогоПериода = Дата(2000, 1, 1);
			ОкончаниеПрошлогоПериода = Дата(2000, 1, 1);
		КонецЕсли;	
	КонецЕсли;		
		
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Субконто", ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств);	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПрошлогоПериода", НачалоПрошлогоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПрошлогоПериода", ОкончаниеПрошлогоПериода);
	
	МассивСчетаДС = Новый Массив;
	МассивСчетаДС.Добавить(ПланыСчетов.Основной.РасчетныеСчета);
	МассивСчетаДС.Добавить(ПланыСчетов.Основной.ВалютныеСчета);
	
	СчетУчетаБрокера = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(ЭтотОбъект.Период.ДатаНачала,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"),
		Истина);
		
	Если СчетУчетаБрокера = ПланыСчетов.Основной.ДенежныеСредстваУБрокера Тогда 																		
		МассивСчетаДС.Добавить(ПланыСчетов.Основной.ДенежныеСредстваУБрокера);
		МассивСчетаДС.Добавить(ПланыСчетов.Основной.ВалютныеСредстваУБрокера);
		УчитыватьПереводы = 0;
	Иначе	
		УчитыватьПереводы = 1;
	КонецЕсли;
	Запрос.УстановитьПараметр("СчетаДС", МассивСчетаДС);
	Запрос.УстановитьПараметр("УчитыватьПереводы", УчитыватьПереводы);
	
	// если счет учета брокера <> 76.14 в отчете учтем переводы между счетами ДС и брокера.
	// деньги брокера считаются дебиторкой. Суммы учтем развернуто. 
	// если счет учета брокеа 55.4, тогда обороты между счетами учета не будем учитывать
	// деньги у брокера при этом считаются собственными. оборот увеличивать не нужно 
		
	ДвиженияДСПроценты = Новый Массив;
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.КупонныйДоход);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ПриходПроцентовМНО);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ПриходПроцентовСМО);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ПроцентыНаМНО);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ПроцентыПоРЕПО);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ПроцентыПоДепозитномуВкладу);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ДоходПоАкциям);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ДоходПоАкциям);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ДоходПоИпотечнымСертификатамУчастия);
	ДвиженияДСПроценты.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ДоходПоДолям);
	Запрос.УстановитьПараметр("ДвиженияДСПроценты", ДвиженияДСПроценты);
	
	ДвиженияДСПродажа = Новый Массив;
	ДвиженияДСПродажа.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ПогашениеОблигации);
	ДвиженияДСПродажа.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ПолучениеЗайма);
	ДвиженияДСПродажа.Добавить(Справочники.ВидыДвиженияДенежныхСредств.Продажа);
	ДвиженияДСПродажа.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ЗакрытиеРЕПО);
	ДвиженияДСПродажа.Добавить(Справочники.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа);
	ДвиженияДСПродажа.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа);
	Запрос.УстановитьПараметр("ДвиженияДСПродажа", ДвиженияДСПродажа);
	
	ДвиженияДСПокупка = Новый Массив;
	ДвиженияДСПокупка.Добавить(Справочники.ВидыДвиженияДенежныхСредств.Покупка);
	ДвиженияДСПокупка.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ОткрытиеРЕПО);
	ДвиженияДСПокупка.Добавить(Справочники.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка);
	ДвиженияДСПокупка.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка);
	ДвиженияДСПокупка.Добавить(Справочники.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияРЕПО);
	ДвиженияДСПокупка.Добавить(Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияРЕПО);
	Запрос.УстановитьПараметр("ДвиженияДСПокупка", ДвиженияДСПокупка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка = Неопределено, Настройка) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,ВидУчета");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ДокументРезультат.Очистить();
	
	Если ЭтотОбъект.Период.ДатаНачала >= Дата(2025, 1, 1) Тогда 
		Вариант = "2025";
		Отчет = ПолучитьМакет("Отчет2025");
	Иначе	
		Вариант = "0";
		Отчет = ПолучитьМакет("Отчет");
	КонецЕсли;
	
	ОбластьОтчет = Отчет.ПолучитьОбласть("Отчет");
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = Период.ДатаОкончания;
	
	ДатаКонечнаяПрошлыйГод = ДобавитьМесяц(ДатаКонечная, -12);
	ДатаНачальнаяПрошлыйГод = ДобавитьМесяц(ДатаНачальная, -12); 
	
	//шапка 
	ЕдиницаИзмерения = Настройка.ЕдиницаИзмерения;
	КолЗнак = Настройка.ТочностьЕдиницыИзмерения;
	
	Если ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда 
		КодЕИ = "383";
		НазвЕИ = "руб";
		Коэффициент = 1;				
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда 
		КодЕИ = "384";
		НазвЕИ = "тыс. руб";
		Коэффициент = 1000;		
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда 
		КодЕИ = "385";
		НазвЕИ = "млн. руб";
		Коэффициент = 1000000;	
	КонецЕсли;	
	СтрокаФормат = "ЧДЦ="+КолЗнак+"; ЧРД=.; ЧРГ=' '; ЧН=-; ЧГ=3,0; ЧО=0";
	
	СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СчетДоверительногоУправления, ДатаКонечная);
	ТаблицаНастроекОтчетностиРСБУ = Отчеты.РегламентированныйОтчетБалансРСБУ.ПолучитьНастройкиОтчетностиРСБУ(Организация, СчетДоверительногоУправления).Выгрузить();

	СтрТекущийГод = КонсолидированнаяОтчетность.ПредставлениеФинансовогоПериода(ДатаНачальная, ДатаКонечная); 
	СтрПрошлыйГод = КонсолидированнаяОтчетность.ПредставлениеФинансовогоПериода(ДатаНачальнаяПрошлыйГод, ДатаКонечнаяПрошлыйГод); 
	
	ОбластьОтчет.Параметры.ТекущийПериод = СтрТекущийГод;
	ОбластьОтчет.Параметры.ПрошлыйПериод = СтрПрошлыйГод;
		
	ОбластьОтчет.Области.КодЕИ.Значение = КодЕИ;
	ОбластьОтчет.Области.НазвЕИ.Значение = НазвЕИ;
	ОбластьОтчет.Области.ПериодОтч.Значение = "за " + СтрТекущийГод;
	
	ОбластьОтчет.Области.Дата_Число.Значение = День(ДатаКонечная);
	ОбластьОтчет.Области.Дата_Месяц.Значение = Месяц(ДатаКонечная);
	ОбластьОтчет.Области.Дата_Год.Значение = Формат(Год(ДатаКонечная),"ЧГ=0");
	
	СтрокаНастройки = ТаблицаНастроекОтчетностиРСБУ.Найти("ФормироватьОтУК");
	
	Если СтрокаНастройки = Неопределено Тогда
		СообщитьОбОшибкеИЗакрытьСессию("Не задана настройка ""Формировать от УК"" отчетности РСБУ в дополнительных сведениях организации!", Механизм, Сессия);
		Возврат;
	Иначе
		ФормироватьОтУК = СтрокаНастройки.Значение;
	КонецЕсли;
	
	Если СтрокаНастройки = Неопределено Тогда
		ОбластьОтчет.Области.ОргКодКФС.Значение    = "";
	Иначе
		ОбластьОтчет.Области.ОргКодКФС.Значение    = СтрокаНастройки.Значение;
		НаименованиеФормыСобственности = ?(СтрокаНастройки.Значение = 16, "частная", "");//считаем что у всех частная собственность. Если нет, то надо добавлять параметр в дополнительные сведения в раздел "Отчетность РСБУ"."
		ОбластьОтчет.Области.ОргФормаСобств.Значение    = НаименованиеФормыСобственности;
	КонецЕсли;
	
	СтрокаНастройки = ТаблицаНастроекОтчетностиРСБУ.Найти("КодПоОКОПФ");
	Если СтрокаНастройки = Неопределено Тогда
		ОбластьОтчет.Области.ОргКодКОПФ.Значение    = "";
	Иначе
		ОбластьОтчет.Области.ОргКодКОПФ.Значение    = СтрокаНастройки.Значение;
	КонецЕсли;
	
	Если ФормироватьОтУК Тогда
		ОбластьОтчет.Области.ОргИНН.Значение    = СведенияОбОрганизации.ИННОрганизации;
		ОбластьОтчет.Области.ОргКодОКПО.Значение    = СведенияОбОрганизации.КодПоОКПООрганизации;
		//берем первый код ОКВЭД
		МестоЗапятой = СтрНайти(СведенияОбОрганизации.КодПоОКВЭДОрганизации, ",");
		Если МестоЗапятой = 0 Тогда
			ОбластьОтчет.Области.ОргКодОКВЭД.Значение    = СокрЛП(СведенияОбОрганизации.КодПоОКВЭДОрганизации);
		Иначе
			ОбластьОтчет.Области.ОргКодОКВЭД.Значение    = СокрЛП(Лев(СведенияОбОрганизации.КодПоОКВЭДОрганизации,МестоЗапятой -1));
		КонецЕсли;
		Если ОбластьОтчет.Области.ОргКодОКВЭД.Значение = "66.12.2" Тогда
			ОбластьОтчет.Области.ВидЭкономическойДеятельности.Значение = "Деятельность по управлению ценными бумагами";
		ИначеЕсли ОбластьОтчет.Области.ОргКодОКВЭД.Значение = "66.30.1" Тогда
			ОбластьОтчет.Области.ВидЭкономическойДеятельности.Значение = "Управление инвестиционными фондами";
		Иначе
			ОбластьОтчет.Области.ВидЭкономическойДеятельности.Значение = "";
		КонецЕсли;
		ОбластьОтчет.Области.ОргНазв.Значение    = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
							СведенияОбОрганизации.КраткоеНаименование + " по договору №" + 
							СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
		ОбластьОтчет.Области.ЗаголовокОтчета.Значение = "Отчет о движении денежных средств";
		ОбластьОтчет.Области.ОргФорма.Значение    = СведенияОбОрганизации.ОрганизационноПравоваяФормаОрганизации;

	Иначе
		ОбластьОтчет.Области.ОргИНН.Значение    = СведенияОбОрганизации.ИНН;
		ОбластьОтчет.Области.ОргКодОКПО.Значение    = СведенияОбОрганизации.КодПоОКПО;
		ОбластьОтчет.Области.ОргКодОКВЭД.Значение    = СведенияОбОрганизации.КодПоОКВЭД;
		ОбластьОтчет.Области.ВидЭкономическойДеятельности.Значение = "";
		ОбластьОтчет.Области.ОргНазв.Значение    = "Учредитель управления " + СведенияОбОрганизации.ПолноеНаименование;
		ОбластьОтчет.Области.ЗаголовокОтчета.Значение = "Отчет о движении денежных средств Доверительного управляющего " 
							+ СведенияОбОрганизации.ПолноеНаименованиеОрганизации 
							+ " по договору № " + СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора,"ДФ=dd.MM.yyyy");
		ОбластьОтчет.Области.ОргФорма.Значение    = СведенияОбОрганизации.ОрганизационноПравоваяФорма;
		//СтрокаОргНазвание = "Учредитель управления "
		//	+ ПараметрыЮрЛица.ОргНазв + Символы.ПС 
		//	+ "Договор №" + СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора,"ДФ=dd.MM.yyyy");
		//ОбластьШапка.Области.ОргНазв.Значение = СтрокаОргНазвание;
		//
	КонецЕсли;
	
	
	
	
	//данные в таблице 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Данные = ПолучитьДанные(Запрос);
	
	Для Каждого СтрокаДанные из Данные Цикл 
		ОбластьОтчет.Области["П"+ СтрокаДанные.Строка + СтрокаДанные.Колонка].Значение = Окр(СтрокаДанные.Сумма/Коэффициент, КолЗнак);	
	КонецЦикла;
	ЗаполнитьИтоги(ОбластьОтчет, СтрокаФормат, Вариант);
	
	
	//подписи
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхРуководитель") Тогда 
		СтруктураДанныхРуководитель = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхРуководитель;	
		Если ЗначениеЗаполнено(СтруктураДанныхРуководитель) Тогда
			ОбластьОтчет.Области.ДолжностьДиректор.Значение = СтруктураДанныхРуководитель.Должность + " (на основании " + СтруктураДанныхРуководитель.ОснованиеПолномочий +  ")";	
			ОбластьОтчет.Области.ОргДиректор.Значение = СтруктураДанныхРуководитель.КонтактноеЛицо;
		КонецЕсли;	
	КонецЕсли;
		
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлавбух") Тогда 
		СтруктураДанныхГлавбух = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхГлавбух;
		ВидимостьПодписиБухгалтера(ОбластьОтчет, ЗначениеЗаполнено(СтруктураДанныхГлавбух));
		Если ЗначениеЗаполнено(СтруктураДанныхГлавбух) Тогда
			ОбластьОтчет.Области.ДолжностьБухгалтера.Значение = СтруктураДанныхГлавбух.Должность;
			ОбластьОтчет.Области.ФИОБухгалтера.Значение = СтруктураДанныхГлавбух.КонтактноеЛицо;
		Иначе
			ОбластьОтчет.Области.ДолжностьБухгалтера.Значение = "";
			ОбластьОтчет.Области.ФИОБухгалтера.Значение = "";
		КонецЕсли;
	КонецЕсли;	
		
	ОбластьОтчет.Области.ДатаОтчета.Значение = ТекущаяДата();
	
	//вывод 
	ДокументРезультат.Вывести(ОбластьОтчет);
	
	//Расшифровка
#Область Расшифровка
	Если ДокументРасшифровка <> Неопределено Тогда 
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияДС.Строка КАК Строка,
		|	ДвиженияДС.ВидДвиженияДС КАК ВидДвиженияДС,
		|	ЕСТЬNULL(Расшифровка01.Сумма, 0) КАК Сумма01,
		|	ЕСТЬNULL(Расшифровка02.Сумма, 0) КАК Сумма02
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_Расшифровка.Строка КАК Строка,
		|		_Расшифровка.ВидДвиженияДС КАК ВидДвиженияДС
		|	ИЗ
		|		_Расшифровка КАК _Расшифровка) КАК ДвиженияДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Расшифровка КАК Расшифровка01
		|		ПО ДвиженияДС.Строка = Расшифровка01.Строка
		|			И ДвиженияДС.ВидДвиженияДС = Расшифровка01.ВидДвиженияДС
		|			И (Расшифровка01.Колонка = ""01"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Расшифровка КАК Расшифровка02
		|		ПО ДвиженияДС.Строка = Расшифровка02.Строка
		|			И ДвиженияДС.ВидДвиженияДС = Расшифровка02.ВидДвиженияДС
		|			И (Расшифровка02.Колонка = ""02"")
		|ИТОГИ
		|	СУММА(Сумма01),
		|	СУММА(Сумма02)
		|ПО
		|	Строка";
			
		Расшифровка = ПолучитьМакет("Расшифровка");
		ОбластьШапка = Расшифровка.ПолучитьОбласть("Шапка");
		ОбластьСтрПоказатель = Расшифровка.ПолучитьОбласть("СтрПоказатель");
		ОбластьСтрВидДвиженияДС = Расшифровка.ПолучитьОбласть("СтрВидДвиженияДС");
		
		ОбластьШапка.Параметры.ТекущийПериод = СтрТекущийГод;
		ОбластьШапка.Параметры.ПрошлыйПериод = СтрПрошлыйГод;
		
		ДокументРасшифровка.Вывести(ОбластьШапка);	
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока Выборка.Следующий() Цикл 
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрПоказатель.Параметры, Выборка);
			ОбластьСтрПоказатель.Параметры.Показатель = ПолучитьНаименованиеПоказателя(Выборка.Строка, ОбластьОтчет);
			ДокументРасшифровка.Вывести(ОбластьСтрПоказатель); 
			
			ДокументРасшифровка.НачатьГруппуСтрок();
			ВыборкаДвижения = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаДвижения.Следующий() Цикл 
				ЗаполнитьЗначенияСвойств(ОбластьСтрВидДвиженияДС.Параметры, ВыборкаДвижения);
				ДокументРасшифровка.Вывести(ОбластьСтрВидДвиженияДС);
			КонецЦикла;	
			ДокументРасшифровка.ЗакончитьГруппуСтрок();		
		КонецЦикла;	
		
		ДокументРасшифровка.ПоказатьУровеньГруппировокСтрок(0);
	КонецЕсли;	
	
#КонецОбласти
	
	СообщитьОбОшибкеИЗакрытьСессию(, Механизм, Сессия);
	
КонецПроцедуры	

Функция ПолучитьНаименованиеПоказателя(НомерСтроки, ОбластьОтчет)
	
	АдресЯчейки = "Н"+ Формат(НомерСтроки,"ЧЦ=2; ЧВН=" );
	
	Область = ОбластьОтчет.ПолучитьОбласть(АдресЯчейки);
	
	Возврат Область.ТекущаяОбласть.Текст;
	
КонецФункции	

Процедура РасчетИтоговогоПоказателя(ОбластьОтчет, Показатель, СтрНомКолонки, ПодчиненныеПоказатели)
		
	Для Каждого Элемент из ПодчиненныеПоказатели Цикл 
		ОбластьОтчет.Области[Показатель + СтрНомКолонки].Значение = ОбластьОтчет.Области[Показатель + СтрНомКолонки].Значение + ОбластьОтчет.Области["П" + Элемент + СтрНомКолонки].Значение;			
	КонецЦикла;	
		
КонецПроцедуры	

Процедура ЗаполнитьИтоги(ОбластьОтчет, СтрокаФормат, Вариант)
	
	Если Вариант = "2025" Тогда
		Итог01 = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("02,03,04,05,06,42");
		КоличествоСтрок = 42;
	Иначе	
		Итог01 = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("02,03,04,05,06");
		КоличествоСтрок = 41;
	КонецЕсли;	
	Итог07 = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("08,09,10,11");
	Итог13 = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("14,15,16,17,18");
	Итог19 = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("20,21,22,23,24");
	Итог26 = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("27,28,29,30,31");
	Итог32 = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("33,34,35,36");
	Итог38 = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("12,25,37");  //общее сальдо по разделам	
	
	Для НомерКолонки = 1 по 2 Цикл 
		СтрНомКолонки = Формат(НомерКолонки, "ЧЦ=2; ЧВН=");
		
		РасчетИтоговогоПоказателя(ОбластьОтчет, "П01", СтрНомКолонки, Итог01);
		РасчетИтоговогоПоказателя(ОбластьОтчет, "П07", СтрНомКолонки, Итог07);
		ОбластьОтчет.Области["П12" + СтрНомКолонки].Значение = ОбластьОтчет.Области["П01" + СтрНомКолонки].Значение + ОбластьОтчет.Области["П07" + СтрНомКолонки].Значение;
		
		РасчетИтоговогоПоказателя(ОбластьОтчет, "П13", СтрНомКолонки, Итог13);
		РасчетИтоговогоПоказателя(ОбластьОтчет, "П19", СтрНомКолонки, Итог19);
		ОбластьОтчет.Области["П25" + СтрНомКолонки].Значение = ОбластьОтчет.Области["П13" + СтрНомКолонки].Значение + ОбластьОтчет.Области["П19" + СтрНомКолонки].Значение;
			
		РасчетИтоговогоПоказателя(ОбластьОтчет, "П26", СтрНомКолонки, Итог26);
		РасчетИтоговогоПоказателя(ОбластьОтчет, "П32", СтрНомКолонки, Итог32);
		ОбластьОтчет.Области["П37" + СтрНомКолонки].Значение = ОбластьОтчет.Области["П26" + СтрНомКолонки].Значение + ОбластьОтчет.Области["П32" + СтрНомКолонки].Значение;
		
		//итог по всем разделам
		РасчетИтоговогоПоказателя(ОбластьОтчет, "П38", СтрНомКолонки, Итог38);
		
		//форматы 
		Для НомерСтроки =1 по КоличествоСтрок Цикл 
			СтрНомСтроки = Формат(НомерСтроки, "ЧЦ=2; ЧВН="); 
			ОбластьОтчет.Области["П" + СтрНомСтроки + СтрНомКолонки].Формат = СтрокаФормат;	
		КонецЦикла;
				
		//проверка, показатели П38 и Остатки должны совпадать.
		ИтогОбороты = ОбластьОтчет.Области["П38" + СтрНомКолонки].Значение; 
		ИтогОстатки = ОбластьОтчет.Области["П40" + СтрНомКолонки].Значение - ОбластьОтчет.Области["П39" + СтрНомКолонки].Значение;
		Разница = ИтогОстатки - ИтогОбороты;		
		Если Разница <> 0 Тогда 
			//отнесем в прочие на инвестиионную деятельность 
			Показатель = ?(Разница < 0, "П18", "П24");
			ПоказательИтог = ?(Разница < 0, "П13", "П19");
			ОбластьОтчет.Области[Показатель + СтрНомКолонки].Значение = ОбластьОтчет.Области[Показатель + СтрНомКолонки].Значение + Разница;  
			//исправим в итогах
			ОбластьОтчет.Области[ПоказательИтог + СтрНомКолонки].Значение = ОбластьОтчет.Области[ПоказательИтог + СтрНомКолонки].Значение + Разница;
			ОбластьОтчет.Области["П25" + СтрНомКолонки].Значение = ОбластьОтчет.Области["П25" + СтрНомКолонки].Значение + Разница;     //сальдо раздела
			ОбластьОтчет.Области["П38" + СтрНомКолонки].Значение = ОбластьОтчет.Области["П38" + СтрНомКолонки].Значение + Разница;     //общее сальдо 
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ВидимостьПодписиБухгалтера(ОбластьПодвал, Показать)
	
	Если Показать Тогда
		ОбластьПодвал.Области["ПодписьБухгалтера"].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ОбластьПодвал.Области["ПодписьБухгалтераНазваниеРеквизита"].Текст = "(подпись)";
		ОбластьПодвал.Области["ФИОБухгалтера"].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ОбластьПодвал.Области["ФИОБухгалтераНазваниеРеквизита"].Текст = "(расшифровка подписи)";
	Иначе
		ОбластьПодвал.Области["ПодписьБухгалтера"].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьПодвал.Области["ПодписьБухгалтераНазваниеРеквизита"].Текст = "";
		ОбластьПодвал.Области["ФИОБухгалтера"].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьПодвал.Области["ФИОБухгалтераНазваниеРеквизита"].Текст = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОбОшибкеИЗакрытьСессию(ТекстСообщения = "", Механизм, Сессия)
	
	Если ТекстСообщения <> "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьПоследнююДатуРеформации(СчетДУ, ДатаПроверки) 
	
	ДатаРеформации = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеформацииБалансов.ДатаРеформации КАК ДатаРеформации
	|ИЗ
	|	РегистрСведений.РеформацииБалансов КАК РеформацииБалансов
	|ГДЕ
	|	РеформацииБалансов.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И РеформацииБалансов.ДатаРеформации < &ДатаПроверки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаРеформации УБЫВ";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДатаРеформации = Выборка.ДатаРеформации + 24*60*60;
	КонецЦикла;
		
	Возврат ДатаРеформации;
	
КонецФункции
